ia/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Inteligência Artificial</title>
<!-- 2024-03-11 Mon 10:19 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Jomi F. Hübner" />
<link rel="stylesheet" type="text/css" href="https://jomifred.github.io/ia/ia.css" />
</head>
<body>
<div id="content">
<h1 class="title">Inteligência Artificial</h1>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Geral</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Uma visão otimista da IA: <a href="./geral/seminco.pdf">slides</a>
</li>
<li><a href="https://drive.google.com/drive/folders/1WaAm91n5FRPzsuUE3Ql0PIwD9fLGg1_V?usp=sharing">Aulas gravadas</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Busca</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><a href="./busca/busca.pdf">slides</a>
</li>
<li><a href="./busca/buscaJava/index.html">implementação</a> (<a href="https://github.com/jomifred/AI/tree/master/search">GitHub</a>)
</li>
<li><a href="./busca/exercicios-busca.pdf">exercícios</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Constraint Satisfaction Problems</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><a href="./csp/exercicioCSP.pdf">exercícios</a>
</li>
<li><a href="./csp/lab-CSP.html">prática em laboratório</a>
</li>
<li><a href="https://github.com/jomifred/AI/tree/master/csp/prolog">exemplos de programas</a>
</li>
<li><a href="./csp/newchap05.pdf">capítulo 5 do livro do R&amp;N</a>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Planejamento automático</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li><a href="./planejamento/slides-planejamento.pdf">slides (draft)</a> 
</li>
<li><a href="https://github.com/jomifred/AI/tree/master/pddl">exemplos de PDDL</a> 
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Representação de Conhecimento</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li><a href="./conhecimento/representacao-conhecimento.pdf">slides</a>
</li>
<li><a href="./conhecimento/sistemas-especialistas.pdf">sistemas especialistas</a>
</li>
<li><a href="./conhecimento/prolog.pdf">prolog</a>
</li>
<li>Exercícios: <a href="./conhecimento/exercicios/bichos.pdf">bichos</a>,
<a href="./conhecimento/exercicios/familia.pdf">familia</a>,
<a href="./conhecimento/exercicios/prolog-video-locadora.pdf">video locadora</a>,   <a href="./conhecimento/exercicios/listas.pdf">listas</a>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Aprendizado</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li><a href="./aprendizado/ch2.pdf">aprendizado de conceitos (slides Tom
Mitchel)</a>
</li>
<li><a href="./aprendizado/id3.pdf">slides ID3</a>
</li>
<li><a href="./aprendizado/exercicios-id3.pdf">exercícios ID3</a>
</li>
<li><a href="./aprendizado/apriori.pdf">slides APRIORI</a>
</li>
<li><a href="./aprendizado/ar.pdf">slides aprendizado por reforço</a>
</li>
<li><a href="./aprendizado/exercicios-ar.pdf">exercícios aprendizado por reforço</a>
</li>
<li><a href="./aprendizado/ar-implementacao.zip">implementação de aprendizado por reforço</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Bibliografia Básica</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li>Russel &amp; Norvig. <a href="http://aima.cs.berkeley.edu/">Artificial Intelligence: A Modern Approach</a>
</li>
<li>Poole &amp; Mackworth. <a href="http://artint.info">Artificial Intelligence: Foundations of Computational Agents</a>
</li>
<li>Tom Mitchell. <a href="http://www.cs.cmu.edu/~tom/mlbook.html">Machine Learning</a> 
</li>
</ul>

<hr  />
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jomi F. Hübner</p>
<p class="date">Created: 2024-03-11 Mon 10:19</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.3.50.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>